tap "fsouza/prettierd"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "localstack/tap"
tap "michaeleisel/zld"
tap "mongodb/brew"
tap "ngrok/ngrok"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "romkatv/powerlevel10k"
tap "stripe/stripe-cli"
brew "boost"
brew "avrdude"
brew "bat"
brew "berglas"
brew "node"
brew "bitwarden-cli"
brew "gettext"
brew "glib"
brew "cairo"
brew "cmake"
brew "cocoapods"
brew "coreutils"
brew "curl"
brew "deno"
brew "direnv"
brew "docker-compose"
brew "folly"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "edencommon"
brew "entr"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "glow"
brew "gnu-sed"
brew "unbound"
brew "gnutls"
brew "libksba"
brew "gnupg"
brew "go"
brew "grep"
brew "harfbuzz"
brew "htop"
brew "jpeg"
brew "jq"
brew "lazygit"
brew "libraqm"
brew "libtool"
brew "little-cms2"
brew "luarocks"
brew "make"
brew "mkcert"
brew "neovim"
brew "nginx"
brew "ninja"
brew "node@16"
brew "openjdk@11"
brew "openjpeg"
brew "pango"
brew "webp"
brew "pillow"
brew "postgresql@14"
brew "powerlevel10k"
brew "pyenv"
brew "python@3.10"
brew "python@3.11"
brew "ripgrep"
brew "rust"
brew "sqlc"
brew "stow"
brew "thefuck"
brew "tmux"
brew "watchman"
brew "wget"
brew "zlib"
brew "zoxide"
brew "zsh"
brew "fsouza/prettierd/prettierd"
brew "heroku/brew/heroku"
brew "localstack/tap/localstack-cli"
brew "stripe/stripe-cli/stripe"
cask "alfred"
cask "dbeaver-community"
cask "discord"
cask "docker"
cask "insomnia"
cask "loom"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "mongodb-compass"
cask "ngrok"
cask "notion"
cask "numi"
cask "postman"
cask "rectangle"
cask "shottr"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "zulu11"
